Moddingear/Phoque2a-boarddef/variant_PHOQUE2A.h
#pragma once

/*----------------------------------------------------------------------------
 *        STM32 pins number
 *----------------------------------------------------------------------------*/
#define PA0                     PIN_A0
#define PA1                     PIN_A1
#define PA2                     PIN_A2
#define PA3                     PIN_A3
#define PA4                     PIN_A4
#define PA5                     PIN_A5
#define PA6                     PIN_A6
#define PA7                     PIN_A7
#define PA8                     8
#define PA9                     9
#define PA10                    10
#define PA11                    11
#define PA12                    12
#define PA13                    13
#define PA14                    14
#define PA15                    15
#define PB0                     PIN_A8
#define PB1                     PIN_A9
#define PB2                     PIN_A10
#define PB3                     19
#define PB4                     20
#define PB5                     21
#define PB6                     22
#define PB7                     23
#define PB8                     24
#define PB9                     25
#define PB10                    26
#define PB11                    PIN_A11
#define PB12                    PIN_A12
#define PB13                    29
#define PB14                    PIN_A13
#define PB15                    PIN_A14
#define PC4                     PIN_A15
#define PC6                     33
#define PC10                    34
#define PC11                    35
#define PC13                    36
#define PC14                    37
#define PC15                    38
#define PF0                     PIN_A16
#define PF1                     PIN_A17
#define PG10                    41

// Alternate pins number
#define PA0_ALT1                (PA0  | ALT1)
#define PA1_ALT1                (PA1  | ALT1)
#define PA2_ALT1                (PA2  | ALT1)
#define PA3_ALT1                (PA3  | ALT1)
#define PA4_ALT1                (PA4  | ALT1)
#define PA6_ALT1                (PA6  | ALT1)
#define PA7_ALT1                (PA7  | ALT1)
#define PA7_ALT2                (PA7  | ALT2)
#define PA7_ALT3                (PA7  | ALT3)
#define PA9_ALT1                (PA9  | ALT1)
#define PA10_ALT1               (PA10 | ALT1)
#define PA11_ALT1               (PA11 | ALT1)
#define PA11_ALT2               (PA11 | ALT2)
#define PA12_ALT1               (PA12 | ALT1)
#define PA12_ALT2               (PA12 | ALT2)
#define PA13_ALT1               (PA13 | ALT1)
#define PA15_ALT1               (PA15 | ALT1)
#define PB0_ALT1                (PB0  | ALT1)
#define PB0_ALT2                (PB0  | ALT2)
#define PB1_ALT1                (PB1  | ALT1)
#define PB1_ALT2                (PB1  | ALT2)
#define PB3_ALT1                (PB3  | ALT1)
#define PB4_ALT1                (PB4  | ALT1)
#define PB4_ALT2                (PB4  | ALT2)
#define PB5_ALT1                (PB5  | ALT1)
#define PB5_ALT2                (PB5  | ALT2)
#define PB6_ALT1                (PB6  | ALT1)
#define PB6_ALT2                (PB6  | ALT2)
#define PB7_ALT1                (PB7  | ALT1)
#define PB7_ALT2                (PB7  | ALT2)
#define PB8_ALT1                (PB8  | ALT1)
#define PB8_ALT2                (PB8  | ALT2)
#define PB9_ALT1                (PB9  | ALT1)
#define PB9_ALT2                (PB9  | ALT2)
#define PB9_ALT3                (PB9  | ALT3)
#define PB11_ALT1               (PB11 | ALT1)
#define PB13_ALT1               (PB13 | ALT1)
#define PB14_ALT1               (PB14 | ALT1)
#define PB15_ALT1               (PB15 | ALT1)
#define PB15_ALT2               (PB15 | ALT2)
#define PC6_ALT1                (PC6  | ALT1)
#define PC10_ALT1               (PC10 | ALT1)
#define PC11_ALT1               (PC11 | ALT1)
#define PC13_ALT1               (PC13 | ALT1)

#define NUM_DIGITAL_PINS        42
#define NUM_ANALOG_INPUTS       18



/* Alias */
#define A_PHASE_UL				PB15
#define A_PHASE_UH				PA10
#define A_PHASE_VL				PB14
#define A_PHASE_VH				PA9
#define A_PHASE_WL				PB13
#define A_PHASE_WH				PA8

#define PIN_SS_DRIVER			PC14	//Gate driver chip select
#define PIN_NFAULT				PC15	//Gate driver fault pin

#define A_VBUS					PA3		//Pin to sense supply voltage, connected to COMP2
#define BRAKE_RESISTOR			PA2		//Brake resistor control, also connected to output of COMP2
#define BRAKE_AF				8		//Alternate function 8
#define BRAKE_DAC				DAC1	//DAC1
#define BRAKE_DAC_CHAN			DAC_CHANNEL_2	//Channel 2
#define BRAKE_COMP				COMP2	//Comparator 2
#define BRAKE_COMP_PLUS			COMP_INPUT_PLUS_IO2
#define BRAKE_COMP_MINUS		COMP_INPUT_MINUS_DAC1_CH2

#define VBUS_MUL_FACTOR			23		//Multiply the adc voltage read by this value to get the supply voltage

//BEMF inputs are connected to comparators with a 10k resistor to phase, 1k to 3.3v and 1k to gnd, so it's offset slightly above ground

#define A_CURRU					PA1		//Current sense connected to phase U
#define A_BEMFU					PA0		//BEMF connected to comparator 3 for phase U

#define A_CURRV					PC4		//Current sense connected to phase V
#define A_BEMFV					PB0		//BEMF connected to comparator 4 for phase V

#define A_CURRW					PB2		//Current sense connected to phase W
#define A_BEMFW					PB1		//BEMF connected to comparator 1 for phase W

#define A_POTENTIOMETER			PA4
#define A_TEMPERATURE			PB12

//Voltage divider based on CMFA104J4250HANT and 100k resistor
#define NTC_B_CONSTANT			4250	//B = ln(R/R0)/(1/T-1/T0)
#define NTC_T0					(273.15f+25)//Kelvin

#define CAN_RX					PB8
#define CAN_TX					PB9
#define CAN_PWR					PC13 //Pin must be high to turn on CAN transceiver

#define SWDIO					PA13
#define SWCLK					PA14

//USART3 on J7
#define J7_TX					PC10
#define J7_RX					PC11

//LPUART1 on J8
#define J8_TX					PB11
#define J8_RX					PB10

#define I2C_SCL					PA15	//SCL of I2C1 on J7
#define I2C_SDA					PB7		//SDA of I2C1 on J8


#define PWM						I2C_SDA		//Legacy PWM input for compat with BG431B-ESC1

//Those pins are fully dedicated to the encoder in Phoque2 retail
#define ENCODER_A				PC6		//Shared with an LED
#define ENCODER_B				PB5		//Shared with an LED
#define ENCODER_Z				PB3 	//Shared with SC60228 select

//5.1k resistors are included, but in case you want to do something with the USB C, they're connected
//Those are not really useful, and reassigned in Phoque2 retail
#define USBCPD_CC1				PB4		
#define USBCPD_CC2				PB6

// On-board LED pin number
#define LED_1					ENCODER_A
#define LED_2					ENCODER_B
#ifndef LED_BUILTIN
	#define LED_BUILTIN				LED_1
#endif

//Changed to a dedicated pin in Phoque2 retail
#define PIN_PWM_MAG_ANGLE
#define PIN_SS_MAG_ANGLE		ENCODER_Z

// SPI definitions
#ifndef PIN_SPI_SS
	#define PIN_SPI_SS				PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS1
	#define PIN_SPI_SS1				PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS2
	#define PIN_SPI_SS2				PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS3
	#define PIN_SPI_SS3				PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_MOSI
	#define PIN_SPI_MOSI			PA7
#endif
#ifndef PIN_SPI_MISO
	#define PIN_SPI_MISO			PA6
#endif
#ifndef PIN_SPI_SCK
	#define PIN_SPI_SCK				PA5
#endif

// I2C definitions
#ifndef PIN_WIRE_SDA
	#define PIN_WIRE_SDA			I2C_SDA
#endif
#ifndef PIN_WIRE_SCL
	#define PIN_WIRE_SCL			I2C_SCL
#endif

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#ifndef TIMER_TONE
	#define TIMER_TONE			TIM6
#endif
#ifndef TIMER_SERVO
	#define TIMER_SERVO			TIM7
#endif

// UART Definitions
#define SERIAL_UART_INSTANCE	1 //Connected to ST-Link

// Default pin used for 'Serial' instance (ex: ST-Link)
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
	#define PIN_SERIAL_RX			J8_RX
#endif
#ifndef PIN_SERIAL_TX
	#define PIN_SERIAL_TX			J8_TX
#endif

/* HAL configuration */
#define HSE_VALUE				(8000000UL)

/* Extra HAL modules */
#if !defined(HAL_DAC_MODULE_DISABLED)
	#define HAL_DAC_MODULE_ENABLED
#endif
#if !defined(HAL_FDCAN_MODULE_DISABLED)
	#define HAL_FDCAN_MODULE_ENABLED
#endif